DAlexis/stm32-usb-bootloader/bootloader-usb/Src/console.c
/*
 * console.c
 *
 *  Created on: 9 дек. 2015 г.
 *      Author: alexey
 */

#include "console.h"
#include "bootloader-config.h"
#include "stm32f1xx_hal.h"
#include <stdio.h>

UART_HandleTypeDef huart1;

void initConsole()
{
#ifdef UART_ENABLED
	huart1.Instance = USART1;
	huart1.Init.BaudRate = UART_BAUDRATE;
	huart1.Init.WordLength = UART_WORDLENGTH_8B;
	huart1.Init.StopBits = UART_STOPBITS_1;
	huart1.Init.Parity = UART_PARITY_NONE;
	huart1.Init.Mode = UART_MODE_TX_RX;
	huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	huart1.Init.OverSampling = UART_OVERSAMPLING_16;
	HAL_UART_Init(&huart1);
#endif
}

void deinitConsile()
{
#ifdef UART_ENABLED
	HAL_UART_DeInit(&huart1);
#endif
}

void infiniteMessage(const char* msg)
{
	for (;;)
	{
		printf(msg);
		HAL_Delay(1000);
	}
}

ssize_t
_write (int fd __attribute__((unused)), const char* buf __attribute__((unused)),
	size_t nbyte __attribute__((unused)))
{
#ifdef UART_ENABLED
	HAL_UART_Transmit(&huart1, buf, nbyte, 1000);
#endif
	return nbyte;
}

int __attribute__((weak))
_fstat(int fildes __attribute__((unused)),
    struct stat* st __attribute__((unused)))
{
  //errno = ENOSYS;
  return -1;
}

int __attribute__((weak))
_lseek(int file __attribute__((unused)), int ptr __attribute__((unused)),
    int dir __attribute__((unused)))
{
  //errno = ENOSYS;
  return -1;
}

int __attribute__((weak))
_close(int fildes __attribute__((unused)))
{
  //errno = ENOSYS;
  return -1;
}

int __attribute__((weak))
_read(int file __attribute__((unused)), char* ptr __attribute__((unused)),
    int len __attribute__((unused)))
{
  //errno = ENOSYS;
  return -1;
}

int __attribute__((weak))
_isatty(int file __attribute__((unused)))
{
  //errno = ENOSYS;
  return 0;
}
